Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_adc.h
#define    ADC_ACQ4_DR_CHID_Pos                                   (16U)
#define    ADC_ACQ4_DR_CHID_Msk                                   (0x1fU << ADC_ACQ4_DR_CHID_Pos)
#define    ADC_ACQ4_DR_CHID                                       ADC_ACQ4_DR_CHID_Msk

#define    ADC_ACQ4_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ4_DR_RESULT_Msk                                 (0x1fffU << ADC_ACQ4_DR_RESULT_Pos)
#define    ADC_ACQ4_DR_RESULT                                     ADC_ACQ4_DR_RESULT_Msk

#define    ADC_DBG_DR_EOC_Pos                                     (16U)
#define    ADC_DBG_DR_EOC_Msk                                     (0x1U << ADC_DBG_DR_EOC_Pos)
#define    ADC_DBG_DR_EOC                                         ADC_DBG_DR_EOC_Msk

#define    ADC_DBG_DR_DOUT_Pos                                    (0U)
#define    ADC_DBG_DR_DOUT_Msk                                    (0x3fffU << ADC_DBG_DR_DOUT_Pos)
#define    ADC_DBG_DR_DOUT                                        ADC_DBG_DR_DOUT_Msk

#define    ADC_DBG_CR_DBG_EN_Pos                                  (16U)
#define    ADC_DBG_CR_DBG_EN_Msk                                  (0x1U << ADC_DBG_CR_DBG_EN_Pos)
#define    ADC_DBG_CR_DBG_EN                                      ADC_DBG_CR_DBG_EN_Msk

#define    ADC_DBG_CR_DBG_CHSEL_Pos                               (8U)
#define    ADC_DBG_CR_DBG_CHSEL_Msk                               (0x1fU << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    ADC_DBG_CR_DBG_CHSEL                                   ADC_DBG_CR_DBG_CHSEL_Msk

#define    ADC_DBG_CR_DBG_CKTICK_Pos                              (1U)
#define    ADC_DBG_CR_DBG_CKTICK_Msk                              (0x1U << ADC_DBG_CR_DBG_CKTICK_Pos)
#define    ADC_DBG_CR_DBG_CKTICK                                  ADC_DBG_CR_DBG_CKTICK_Msk

#define    ADC_DBG_CR_DBG_SOC_Pos                                 (0U)
#define    ADC_DBG_CR_DBG_SOC_Msk                                 (0x1U << ADC_DBG_CR_DBG_SOC_Pos)
#define    ADC_DBG_CR_DBG_SOC                                     ADC_DBG_CR_DBG_SOC_Msk



#define    FL_ADC_ACQ0                                            (0x1U << 0U)
#define    FL_ADC_ACQ1                                            (0x1U << 1U)
#define    FL_ADC_ACQ2                                            (0x1U << 2U)
#define    FL_ADC_ACQ3                                            (0x1U << 3U)
#define    FL_ADC_SCAN_ACQ                                        (0x1U << 4U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH0                 (0x0U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH1                 (0x1U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH2                 (0x2U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH3                 (0x3U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH4                 (0x4U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH5                 (0x5U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH6                 (0x6U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH7                 (0x7U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH8                 (0x8U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH9                 (0x9U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH10                (0xaU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH11                (0xbU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_DAC1                (0xcU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_DAC2                (0xdU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_AVREF               (0xeU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_TS                  (0xfU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFP               (0x10U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFN               (0x11U << 9U)

#define    FL_ADC_SCANACQ_EXTERNAL_CH0                            (0x1U << 0U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH1                            (0x1U << 1U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH2                            (0x1U << 2U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH3                            (0x1U << 3U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH4                            (0x1U << 4U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH5                            (0x1U << 5U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH6                            (0x1U << 6U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH7                            (0x1U << 7U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH8                            (0x1U << 8U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH9                            (0x1U << 9U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH10                           (0x1U << 10U)
#define    FL_ADC_SCANACQ_EXTERNAL_CH11                           (0x1U << 11U)
#define    FL_ADC_SCANACQ_INTERNAL_DAC1                           (0x1U << 12U)
#define    FL_ADC_SCANACQ_INTERNAL_DAC2                           (0x1U << 13U)
#define    FL_ADC_SCANACQ_INTERNAL_AVREF                          (0x1U << 14U)
#define    FL_ADC_SCANACQ_INTERNAL_TS                             (0x1U << 15U)
#define    FL_ADC_ALL_CHANNEL                                     (0xffffffffU << 0U)
#define    FL_ADC_ACQ_TRGI_SOFE_TRGO                              (0x0U << 4U)
#define    FL_ADC_ACQ_TRGI_LUT0_TRGO                              (0x1U << 4U)
#define    FL_ADC_ACQ_TRGI_LUT1_TRGO                              (0x2U << 4U)
#define    FL_ADC_ACQ_TRGI_LUT2_TRGO                              (0x3U << 4U)
#define    FL_ADC_ACQ_TRGI_LUT3_TRGO                              (0x4U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM0_TRGO                             (0x5U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM1_TRGO                             (0x6U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM0_TRGO2                            (0x7U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM1_TRGO2                            (0x8U << 4U)
#define    FL_ADC_ACQ_TRGI_GPTIM0_TRG0                            (0x9U << 4U)
#define    FL_ADC_ACQ_TRGI_GPTIM1_TRG0                            (0xaU << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM2_TRG0                             (0xbU << 4U)
#define    FL_ADC_ACQ_TRGI_GPTIM5_TRG0                            (0xcU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU0_TRG00                             (0xdU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU0_TRG01                             (0xeU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU0_TRG02                             (0xfU << 4U)
#define    FL_ADC_ACQ_TRGI_TAU0_TRG03                             (0x10U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU0_TRG04                             (0x11U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU0_TRG05                             (0x12U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP1_TRG0                             (0x13U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP2_TRG0                             (0x14U << 4U)
#define    FL_ADC_ACQ_TRGI_TAU0_TRG06                             (0x15U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM2_TRG02                            (0x16U << 4U)
#define    FL_ADC_ACQ_TRGI_LPTIM_TRG0                             (0x17U << 4U)
#define    FL_ADC_ACQ_TRGI_BSTIM_TRG0                             (0x18U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP3_TRG0                             (0x19U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP4_TRG0                             (0x1aU << 4U)
#define    FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK                      (0x0U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK                      (0x1U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK                      (0x2U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK                      (0x3U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK                     (0x4U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK                     (0x5U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK                     (0x6U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK                     (0x7U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK                     (0x8U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK                     (0x9U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK                    (0xaU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK                    (0xbU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK                    (0xcU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK                    (0xdU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK                    (0xeU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK                    (0xfU << 0U)
#define    FL_ADC_EXTERNAL_CH0                                    (0x1U << 0U)
#define    FL_ADC_EXTERNAL_CH1                                    (0x1U << 1U)
#define    FL_ADC_EXTERNAL_CH2                                    (0x1U << 2U)
#define    FL_ADC_EXTERNAL_CH3                                    (0x1U << 3U)
#define    FL_ADC_EXTERNAL_CH4                                    (0x1U << 4U)
#define    FL_ADC_EXTERNAL_CH5                                    (0x1U << 5U)
#define    FL_ADC_EXTERNAL_CH6                                    (0x1U << 6U)
#define    FL_ADC_EXTERNAL_CH7                                    (0x1U << 7U)
#define    FL_ADC_EXTERNAL_CH8                                    (0x1U << 8U)
#define    FL_ADC_EXTERNAL_CH9                                    (0x1U << 9U)
#define    FL_ADC_EXTERNAL_CH10                                   (0x1U << 10U)
#define    FL_ADC_EXTERNAL_CH11                                   (0x1U << 11U)
#define    FL_ADC_INTERNAL_DAC1                                   (0x1U << 24U)
#define    FL_ADC_INTERNAL_DAC2                                   (0x1U << 25U)
#define    FL_ADC_INTERNAL_ACREF                                  (0x1U << 26U)
#define    FL_ADC_INTERNAL_TS                                     (0x1U << 27U)



#define    FL_ADC_BOOTSTRAP_Voltage_VDDA                          (0x0U << ADC_CFGR1_CTRL_BOOST_Pos)
#define    FL_ADC_BOOTSTRAP_Voltage_2P5V                          (0x1U << ADC_CFGR1_CTRL_BOOST_Pos)


#define    FL_ADC_SOC_EDGE_MODE_RISE                              (0x0U << ADC_CFGR1_SOCIF_CFG_Pos)
#define    FL_ADC_SOC_EDGE_MODE_FALL                              (0x1U << ADC_CFGR1_SOCIF_CFG_Pos)


