Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_adc.h
#define    FL_ADC_APBCLK_PSC_DIV1                                 (0x1U << ADC_CFGR1_PCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV2                                 (0x2U << ADC_CFGR1_PCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV3                                 (0x3U << ADC_CFGR1_PCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV4                                 (0x4U << ADC_CFGR1_PCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV5                                 (0x5U << ADC_CFGR1_PCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV6                                 (0x6U << ADC_CFGR1_PCLK_PSC_Pos)


#define    FL_ADC_VCM_MODE_PERIODIC                               (0x0U << ADC_CFGR1_VCM_CTRL_Pos)
#define    FL_ADC_VCM_MODE_CONTINUOUS                             (0x1U << ADC_CFGR1_VCM_CTRL_Pos)


#define    FL_ADC_INJ_MODE_DELAY                                  (0x0U << ADC_CFGR1_INJ_MODE_Pos)
#define    FL_ADC_INJ_MODE_IMMEDIA                                (0x1U << ADC_CFGR1_INJ_MODE_Pos)


#define    FL_ADC_Negative_Peference_VSSA                         (0x0U << ADC_CFGR1_REFNSEL_Pos)
#define    FL_ADC_Negative_Peference_VREFN                        (0x1U << ADC_CFGR1_REFNSEL_Pos)


#define    FL_ADC_REF_SOURCE_VDDA                                 (0x0U << ADC_CFGR1_PEFPSEL_Pos)
#define    FL_ADC_REF_SOURCE_VREFP                                (0x1U << ADC_CFGR1_PEFPSEL_Pos)


#define    FL_ADC_OVERSAMPLING_SHIFT_0B                           (0x0U << ADC_CFGR2_AVGR_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_1B                           (0x1U << ADC_CFGR2_AVGR_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_2B                           (0x2U << ADC_CFGR2_AVGR_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_3B                           (0x3U << ADC_CFGR2_AVGR_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_4B                           (0x4U << ADC_CFGR2_AVGR_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_5B                           (0x5U << ADC_CFGR2_AVGR_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_6B                           (0x6U << ADC_CFGR2_AVGR_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_7B                           (0x7U << ADC_CFGR2_AVGR_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_8B                           (0x8U << ADC_CFGR2_AVGR_OVSS_Pos)


#define    FL_ADC_OVERSAMPLING_MUL_2X                             (0x0U << ADC_CFGR2_AVGR_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_4X                             (0x1U << ADC_CFGR2_AVGR_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_8X                             (0x2U << ADC_CFGR2_AVGR_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_16X                            (0x3U << ADC_CFGR2_AVGR_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_32X                            (0x4U << ADC_CFGR2_AVGR_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_64X                            (0x5U << ADC_CFGR2_AVGR_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_128X                           (0x6U << ADC_CFGR2_AVGR_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_256X                           (0x7U << ADC_CFGR2_AVGR_OVSR_Pos)


#define    FL_ADC_OVERSAMPLING_MODE_DISABLE                       (0x0U << ADC_CFGR2_AVGEN_Pos)
#define    FL_ADC_OVERSAMPLING_MODE_ENABLE_AVERAGE                (0x1U << ADC_CFGR2_AVGEN_Pos)
#define    FL_ADC_OVERSAMPLING_MODE_ENABLE_RESERVE                (0x2U << ADC_CFGR2_AVGEN_Pos)


#define    FL_ADC_SCANACQ_CONV_MODE_SEMIAUTO                      (0x0U << ADC_CFGR2_AUTO_SCAN_Pos)
#define    FL_ADC_SCANACQ_CONV_MODE_AUTO                          (0x1U << ADC_CFGR2_AUTO_SCAN_Pos)


#define    FL_ADC_SCANACQ_SCAN_DIR_BACKWARD                       (0x0U << ADC_CFGR2_SCANDIR_Pos)
#define    FL_ADC_SCANACQ_SCAN_DIR_FORWARD                        (0x1U << ADC_CFGR2_SCANDIR_Pos)




#define    FL_ADC_SCANACQ_TRGI_SOFE_TRGO                          (0x0U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_LUT0_TRGO                          (0x1U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_LUT1_TRGO2                         (0x2U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_LUT2_TRGO                          (0x3U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_LUT3_TRGO                          (0x4U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_ATIM0_TRGO                         (0x5U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_ATIM1_TRGO                         (0x6U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_ATIM0_TRGO2                        (0x7U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_ATIM1_TRGO2                        (0x8U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_GPTIM0_TRGO                        (0x9U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_GPTIM1_TRGO                        (0xaU << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_ATIM2_TRGO                         (0xbU << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_GPTIM5_TRGO                        (0xcU << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_TAU0_TRGO0                         (0xdU << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_TAU0_TRGO1                         (0xeU << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_TAU0_TRGO2                         (0xfU << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_TAU0_TRGO3                         (0x10U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_TAU0_TRGO4                         (0x11U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_TAU0_TRGO5                         (0x12U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_COMP1_TRGO                         (0x13U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_COMP2_TRGO                         (0x14U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_TAU0_TRGO6                         (0x15U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_ATIM2_TRGO2                        (0x16U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_LPTIM_TRGO                         (0x17U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_BSTIM_TRGO                         (0x18U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_COMP3_TRGO                         (0x19U << ADC_SCANACQ_CR_TRIGSEL_Pos)
#define    FL_ADC_SCANACQ_TRGI_COMP4_TRGO                         (0x1aU << ADC_SCANACQ_CR_TRIGSEL_Pos)


#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_1_ADCCLK              (0x0U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_2_ADCCLK              (0x1U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_4_ADCCLK              (0x2U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_8_ADCCLK              (0x3U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_12_ADCCLK             (0x4U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_16_ADCCLK             (0x5U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_32_ADCCLK             (0x6U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_64_ADCCLK             (0x7U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_80_ADCCLK             (0x8U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_96_ADCCLK             (0x9U << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_128_ADCCLK            (0xaU << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_160_ADCCLK            (0xbU << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_192_ADCCLK            (0xcU << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_256_ADCCLK            (0xdU << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_320_ADCCLK            (0xeU << ADC_SCANACQ_CR_SMTS_SLOW_Pos)
#define    FL_ADC_SCANACQ_SAMPLING_LOW_TIME_512_ADCCLK            (0xfU << ADC_SCANACQ_CR_SMTS_SLOW_Pos)

#define    FL_ADC_SAMPLING_TIME_1_ADCCLK                      (0x0U << 0U)
#define    FL_ADC_SAMPLING_TIME_2_ADCCLK                      (0x1U << 0U)
#define    FL_ADC_SAMPLING_TIME_4_ADCCLK                      (0x2U << 0U)
#define    FL_ADC_SAMPLING_TIME_8_ADCCLK                      (0x3U << 0U)
#define    FL_ADC_SAMPLING_TIME_12_ADCCLK                     (0x4U << 0U)
#define    FL_ADC_SAMPLING_TIME_16_ADCCLK                     (0x5U << 0U)
#define    FL_ADC_SAMPLING_TIME_32_ADCCLK                     (0x6U << 0U)
#define    FL_ADC_SAMPLING_TIME_64_ADCCLK                     (0x7U << 0U)
#define    FL_ADC_SAMPLING_TIME_80_ADCCLK                     (0x8U << 0U)
#define    FL_ADC_SAMPLING_TIME_96_ADCCLK                     (0x9U << 0U)
#define    FL_ADC_SAMPLING_TIME_128_ADCCLK                    (0xaU << 0U)
#define    FL_ADC_SAMPLING_TIME_160_ADCCLK                    (0xbU << 0U)
#define    FL_ADC_SAMPLING_TIME_192_ADCCLK                    (0xcU << 0U)
#define    FL_ADC_SAMPLING_TIME_256_ADCCLK                    (0xdU << 0U)
#define    FL_ADC_SAMPLING_TIME_320_ADCCLK                    (0xeU << 0U)
#define    FL_ADC_SAMPLING_TIME_512_ADCCLK                    (0xfU << 0U)

#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH0                 (0x0U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH1                 (0x1U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH2                 (0x2U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH3                 (0x3U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH4                 (0x4U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH5                 (0x5U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH6                 (0x6U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH7                 (0x7U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH8                 (0x8U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH9                 (0x9U << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH10                (0xaU << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH11                (0xbU << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_DAC1                (0xcU << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_DAC2                (0xdU << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_AVREF               (0xeU << ADC_DBG_CR_DBG_CHSEL_Pos)
#define    FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_TS                  (0xfU << ADC_DBG_CR_DBG_CHSEL_Pos)


#define    FL_ADC_DBG_ADC_CLK_INVALID                             (0x0U << ADC_DBG_CR_DBG_CKTICK_Pos)
#define    FL_ADC_DBG_ADC_CLK_FORWARD                             (0x1U << ADC_DBG_CR_DBG_CKTICK_Pos)


#define    FL_ADC_DBG_ADC_SOC_LOW                                 (0x0U << ADC_DBG_CR_DBG_SOC_Pos)
#define    FL_ADC_DBG_ADC_SOC_HIGH                                (0x1U << ADC_DBG_CR_DBG_SOC_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup ADC_FL_Exported_Functions ADC Exported Functions
  * @{
  */

/**
  * @brief    获取ADC 转换开始标志

