Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_adc.h
/**
  * @brief    读取ACQ3触发源
  * @rmtoll   ACQ3_CR    TRIGSEL    FL_ADC_GetACQ3TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_TRGI_SOFE_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_LUT0_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_LUT1_TRGO2
  *           @arg @ref FL_ADC_ACQ_TRGI_LUT2_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_LUT3_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM2_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_GPTIM5_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU0_TRGO0
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU0_TRGO1
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU0_TRGO2
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU0_TRGO3
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU0_TRGO4
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU0_TRGO5
  *           @arg @ref FL_ADC_ACQ_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU0_TRGO6
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM2_TRGO2
  *           @arg @ref FL_ADC_ACQ_TRGI_LPTIM_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_BSTIM_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_COMP3_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_COMP4_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ3TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_CR, ADC_ACQ3_CR_TRIGSEL_Msk));
}

/**
  * @brief    设置ACQ3采样时间
  * @rmtoll   ACQ3_CR    SMTS    FL_ADC_SetACQ3SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ3SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ3_CR, ADC_ACQ3_CR_SMTS_Msk, time);
}

/**
  * @brief    读取ACQ3采样时间
  * @rmtoll   ACQ3_CR    SMTS    FL_ADC_GetACQ3SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ3SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_CR, ADC_ACQ3_CR_SMTS_Msk));
}

/**
  * @brief    设置SCAN ACQ触发源
  * @rmtoll   SCANACQ_CR    TRIGSEL    FL_ADC_SetSCANACQTriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_TRGI_SOFE_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LUT0_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LUT1_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LUT2_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LUT3_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM2_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_GPTIM5_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO0
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO1
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO3
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO4
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO5
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO6
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM2_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LPTIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_BSTIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP3_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP4_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetSCANACQTriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ4_CR, ADC_SCANACQ_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    读取SCAN ACQ触发源
  * @rmtoll   SCANACQ_CR    TRIGSEL    FL_ADC_GetSCANACQTriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_TRGI_SOFE_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LUT0_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LUT1_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LUT2_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LUT3_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM2_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_GPTIM5_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO0
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO1
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO3
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO4
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO5
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRGO6
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM2_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LPTIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_BSTIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP3_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP4_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetSCANACQTriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ4_CR, ADC_SCANACQ_CR_TRIGSEL_Msk));
}

/**
  * @brief    设置慢速通道采样时间
  * @rmtoll   SCANACQ_CR    SMTS_SLOW    FL_ADC_SetSCANACQSlowChannelSamplingTime
  * @param    ADCx ADC instance
  * @param    lowtime This parameter can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetSCANACQSlowChannelSamplingTime(ADC_Type *ADCx, uint32_t lowtime)
{
    MODIFY_REG(ADCx->ACQ4_CR, ADC_SCANACQ_CR_SMTS_SLOW_Msk, lowtime);
}

/**
  * @brief    读取慢速通道采样时间
  * @rmtoll   SCANACQ_CR    SMTS_SLOW    FL_ADC_GetSCANACQSlowChannelSamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GetSCANACQSlowChannelSamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ4_CR, ADC_SCANACQ_CR_SMTS_SLOW_Msk));
}

/**
  * @brief    设置DMA组合通道

  * @rmtoll   DMACOMB_CR    COMB_ACQEN    FL_ADC_SetACQDMACombination
  * @param    ADCx ADC instance
  * @param    channel_acq This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_SCAN_ACQ
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_ADC_SetACQDMACombination(ADC_Type *ADCx, uint32_t channel_acq)
{
    MODIFY_REG(ADCx->DMACOMB_CR, ADC_DMACOMB_CR_COMB_ACQEN_Msk, channel_acq);
}

/**
  * @brief    获取DMA组合通道

  * @rmtoll   DMACOMB_CR    COMB_ACQEN    FL_ADC_GetACQDMACombination
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQDMACombination(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMACOMB_CR, ADC_DMACOMB_CR_COMB_ACQEN_Msk));
}

/**
  * @brief    获取转换结果对应通道ID

  * @rmtoll   DMACOMB_DR    ACQ_ID    FL_ADC_GetConversionChannelID
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_ADC_GetDMAConversionChannelID(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMACOMB_DR, ADC_DMACOMB_DR_ACQ_ID_Msk));
}

/**
  * @brief    获取ADC转换结果

