Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_adc.h
  * @rmtoll   DMACOMB_DR    COMB_DR    FL_ADC_GetConversionResult
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_ADC_GetDMAConversionResult(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMACOMB_DR, ADC_DMACOMB_DR_COMB_DR_Msk));
}

/**
  * @brief    获取ACQ0转换数据
  * @rmtoll   ACQ0_DR    RESULT    FL_ADC_ReadACQ0_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ0_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ0_DR, (0x1fffU << 0U)) >> 0U);
}

/**
  * @brief    获取ACQ1转换数据
  * @rmtoll   ACQ1_DR    RESULT    FL_ADC_ReadACQ1_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ1_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ1_DR, (0x1fffU << 0U)) >> 0U);
}

/**
  * @brief    获取ACQ2转换数据
  * @rmtoll   ACQ2_DR    RESULT    FL_ADC_ReadACQ2_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ2_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ2_DR, (0x1fffU << 0U)) >> 0U);
}

/**
  * @brief    获取ACQ3转换数据
  * @rmtoll   ACQ3_DR    RESULT    FL_ADC_ReadACQ3_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ3_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_DR, (0x1fffU << 0U)) >> 0U);
}

/**
  * @brief    获取扫描通道的通道号
  * @rmtoll   ACQ4_DR    CHID    FL_ADC_ReadSCANACQ_ChannelID
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadSCANACQ_ChannelID(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ4_DR, (0x1fU << 16U)) >> 16U);
}

/**
  * @brief    获取ACQ4转换数据
  * @rmtoll   ACQ4_DR    RESULT    FL_ADC_ReadSCANACQ_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadSCANACQ_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ4_DR, (0x1fffU << 0U)) >> 0U);
}

/**
  * @brief    获取debug模式下ADC的EOC
  * @rmtoll   DBG_DR    EOC    FL_ADC_ReadEOC_DEBUG
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_ADC_ReadEOC_DEBUG(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DBG_DR, ADC_DBG_DR_EOC_Msk));
}

/**
  * @brief    debug模式下ADC的DOUT
  * @rmtoll   DBG_DR    DOUT    FL_ADC_ReadADCDout_DEBUG
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadADCDout_DEBUG(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DBG_DR, (0x3fffU << 0U)) >> 0U);
}

/**
  * @brief    失能 DEBIG 模式
  * @rmtoll   DBG_CR    DBG_EN    FL_ADC_DisableDEBUG
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableDEBUG(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->DBG_CR, ADC_DBG_CR_DBG_EN_Msk);
}

/**
  * @brief    获取ADC DEBIG 模式使能状态
  * @rmtoll   DBG_CR    DBG_EN    FL_ADC_IsEnabledDEBUG
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledDEBUG(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DBG_CR, ADC_DBG_CR_DBG_EN_Msk) == ADC_DBG_CR_DBG_EN_Msk);
}

/**
  * @brief    设置DEBUG通道
  * @rmtoll   DBG_CR    DBG_CHSEL    FL_ADC_SetDEBUGChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH0
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH1
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH2
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH3
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH4
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH5
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH6
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH7
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH8
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH9
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH10
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH11
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_DAC1
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_DAC2
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_AVREF
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_TS
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDEBUGChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->DBG_CR, ADC_DBG_CR_DBG_CHSEL_Msk, channel);
}

/**
  * @brief    读取DEBUG通道
  * @rmtoll   DBG_CR    DBG_CHSEL    FL_ADC_GetDEBUGChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH0
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH1
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH2
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH3
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH4
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH5
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH6
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH7
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH8
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH9
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH10
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_EXTERNAL_CH11
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_DAC1
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_DAC2
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_AVREF
  *           @arg @ref FL_ADC_DBG_SELECT_CHANNEL_INTERNAL_TS
  */
__STATIC_INLINE uint32_t FL_ADC_GetDEBUGChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DBG_CR, ADC_DBG_CR_DBG_CHSEL_Msk));
}

/**
  * @brief    设置 debug模式下ADC CLCOK
  * @rmtoll   DBG_CR    DBG_CKTICK    FL_ADC_SetADCCLK_DEBUG
  * @param    ADCx ADC instance
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DBG_ADC_CLK_INVALID
  *           @arg @ref FL_ADC_DBG_ADC_CLK_FORWARD
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetADCCLK_DEBUG(ADC_Type *ADCx, uint32_t clock)
{
    MODIFY_REG(ADCx->DBG_CR, ADC_DBG_CR_DBG_CKTICK_Msk, clock);
}

/**
  * @brief    读取debug模式下ADC CLCOK
  * @rmtoll   DBG_CR    DBG_CKTICK    FL_ADC_GetADCCLK_DEBUG
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DBG_ADC_CLK_INVALID
  *           @arg @ref FL_ADC_DBG_ADC_CLK_FORWARD
  */
__STATIC_INLINE uint32_t FL_ADC_GetADCCLK_DEBUG(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DBG_CR, ADC_DBG_CR_DBG_CKTICK_Msk));
}

/**
  * @brief    设置debug模式下ADC的SOC控制
  * @rmtoll   DBG_CR    DBG_SOC    FL_ADC_SetADCSOC_DEBUG
  * @param    ADCx ADC instance
  * @param    soc This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DBG_ADC_SOC_LOW
  *           @arg @ref FL_ADC_DBG_ADC_SOC_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetADCSOC_DEBUG(ADC_Type *ADCx, uint32_t soc)
{
    MODIFY_REG(ADCx->DBG_CR, ADC_DBG_CR_DBG_SOC_Msk, soc);
}

/**
  * @brief    读取debug模式下ADC的SOC控制
  * @rmtoll   DBG_CR    DBG_SOC    FL_ADC_GetADCSOC_DEBUG
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DBG_ADC_SOC_LOW
  *           @arg @ref FL_ADC_DBG_ADC_SOC_HIGH
  */
__STATIC_INLINE uint32_t FL_ADC_GetADCSOC_DEBUG(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DBG_CR, ADC_DBG_CR_DBG_SOC_Msk));
}

/**
  * @}
  */

/** @defgroup ADC_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_ADC_CommonDeInit(ADC_Type *ADCx);
FL_ErrorStatus FL_ADC_CommonInit(ADC_Type *ADCx,FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
void FL_ADC_CommonStructInit(FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
FL_ErrorStatus  FL_ADC_DeInit(ADC_Type *ADCx);
FL_ErrorStatus FL_ADC_Init(ADC_Type *ADCx, FL_ADC_InitTypeDef  *ADC_InitStruct,uint32_t ACQx_ID);
void FL_ADC_StructInit(FL_ADC_InitTypeDef *ADC_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LD0XX_FL_ADC_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2025-02-28*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
